"Aw crap" = "אה שטויות";
"Back" = "בחזרה";
"Half full" = "חצי מלא";
"How ya feeling today?" = "מה השלום מרגיש היום?";
"Live half full." = "לחיות חצי מלא.";
"Loading..." = "טוען ...";
"Next" = "הבא";
"No internet connection" = "אין חיבור לאינטרנט";
"OK" = "אישור";
"Patience is a virtue." = "סבלנות היא מעלה.";
"Share to Facebook" = "שתף אל פייסבוק";
"Share to Twitter" = "שתף אל Twitter";
"Sorry, this quote is too long to post to Twitter." = "מצטער, הציטוט הזה הוא יותר מדי זמן כדי לפרסם בטוויטר.";
"The app that turns your frown upside down with a dose of inspiration to kick any bad mood in the butt!" = "האפליקציה שהופכת את הזעף במהופך עם מינון של השראה לבעוט כל מצב רוח רעה בתחת!";
"The glass is always" = "הכוס תמיד";
"The quote hasn't loaded yet." = "הציטוט לא טעון עדיין.";
"Try Again" = "נסה שוב";
"Whoops" = "אופס";
"don't be angry." = "כועס";
"don't be impatient." = "קצר רוח";
"don't be tired." = "עייף";
"don't be lonely." = "בודד";
"don't be depressed." = "מדוכא";
"don't be guilty." = "אשם";
"don't be sad." = "עצוב";
"don't be nostalgic." = "נוסטלגי";
"don't be jealous." = "מקנא";
"don't be dull." = "משעמם";
"don't be scared." = "פחד";
"don't be anxious." = "חרד";
"angry" = "כועס";
"impatient" = "קצר רוח";
"tired" = "עייף";
"lonely" = "בודד";
"depressed" = "מדוכא";
"guilty" = "אשם";
"sad" = "עצוב";
"nostalgic" = "נוסטלגי";
"jealous" = "מקנא";
"dull" = "משעמם";
"scared" = "פחד";
"anxious" = "חרד";
